InformationRegisters/ИнформацияОбОбразовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ИнформацияОбОбразовании</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГодОбучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебноеПособие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеПособия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнформацияОбОбразовании/Ext/ManagerModule.bsl
Функция ПолучитьИнформациюОбОбразовании(Обучающийся) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеЗаведение,
	                      |	ИнформацияОбОбразованииСрезПоследних.ГодОбучения,
	                      |	ИнформацияОбОбразованииСрезПоследних.УчебноеПособие
	                      |ИЗ
	                      |	РегистрСведений.ИнформацияОбОбразовании.СрезПоследних КАК ИнформацияОбОбразованииСрезПоследних
	                      |ГДЕ
	                      |	ИнформацияОбОбразованииСрезПоследних.Обучающийся = &Обучающийся");
	
	Запрос.УстановитьПараметр("Обучающийся", Обучающийся);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьИнформациюОбОбразовании(Обучающийся, УчебноеЗаведение, ГодОбучения, УчебноеПособие) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Обучающийся		= Обучающийся;
	Запись.Период			= ТекущаяДата();
	Запись.УчебноеЗаведение	= УчебноеЗаведение;
	Запись.ГодОбучения		= ГодОбучения;
	Запись.УчебноеПособие	= УчебноеПособие;
	Запись.Записать();

КонецПроцедуры
